# Missing Data

In [3]:
import numpy as np

In [4]:
import pandas as pd

In [1]:
# sometimes python has missing values and it automatically puts an "nan" in it.
# here we will see how we can drop those nan's and also how we can fill the values in place of nan.

In [12]:
#let's create a dictionary  with rows and columns and convert that into a dataframe

d = {'A':[1,np.nan,3],'B':[4,np.nan,np.nan,],'C':[5,6,7]}

In [13]:
df = pd.DataFrame(d)

In [14]:
df

     A    B  C
0  1.0  4.0  5
1  NaN  NaN  6
2  3.0  NaN  7

In [15]:
df.dropna() # if we do this it will delete all the na's with a complete row meaning whichever row the nan is present 
# it will delete all the rows because by default the axis = 0 in the argument

     A    B  C
0  1.0  4.0  5

In [16]:
df.dropna(axis=1) # here it will delete all the columns containing nan

   C
0  5
1  6
2  7

In [20]:
df.dropna(thresh=2) # thresh is also an argument when we put values in it it means 
# it should have at least that many non-nan values here in this rows with at least two non-nan values

     A    B  C
0  1.0  4.0  5
2  3.0  NaN  7

In [22]:
df.dropna(thresh=1)

     A    B  C
0  1.0  4.0  5
1  NaN  NaN  6
2  3.0  NaN  7

In [23]:
df.dropna(thresh=3)

     A    B  C
0  1.0  4.0  5

In [24]:
# let's see now how we can substitute the na values with some value integer float anything we will use fillna for that
df.fillna(value = 'FILL VALUE')

            A           B  C
0           1           4  5
1  FILL VALUE  FILL VALUE  6
2           3  FILL VALUE  7

In [26]:
#let's try something different
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64